#include "main.h"

struct month months[ALL_MONTHS]= {
{"Январь","ЯНВ",31,1},
{"Февраль","ФЕВ",28,2},
{"March","MAR",31,3},
{"April","APR",30,4},
{"Май","МАЙ",31,5},
{"Июнь","ИЮН",30,6},
{"Июль","ИЮЛ",31,7},
{"Август","АВГ",31,8},
{"Сентябрь","СЕН",30,9},
{"Октябрь","ОКТ",31,10},
{"Ноябрь","НОЯ",30,11},
{"Декабрь","ДЕК",31,12}
};

int main()
{
    system("chcp 1251");
    char arr[SIZE];
    int days;

    printf("Введите название месяца (пустая строка для выхода): ");
    while(s_gets(arr, SIZE)!=NULL && arr[0]!='\0')
    {
        days=calc(months, ALL_MONTHS, arr);
        if(days)
            printf("От начала года до конца выбранного месяца %d дней.\n", days);
        //else printf("Месяц с названием %s мне неизвестен.\n", arr);

        printf("Введите название месяца (пустая строка для выхода): ");
    }
    printf("\nHello world!\n");
    return 0;
}
